Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: An oral presentation of the bachelor's thesis lasting 15-30 minutes is given on the Royal Norwegian Naval Academy’s bachelor day.
nb: En muntlig presentasjon av bacheloroppgaven på 15-30 minutter på Sjøkrigsskolens bachelordag.

source: The voyage goes from Bergen to the Oslo Fjord via Blindleia with half the class, and returns with the second half the week after.
nb: Seilasen går fra Bergen til Oslo fjorden via Blindleia med halve klassen, og retur med den andre halvdelen uka etter.

source: Describe and contextualise principles and concepts for implementing logistics nationally and internationally, also in UN and NATO contexts.
nb: Beskrive og kontekstualisere prinsipper og konsepter for utøvelsen av logistikk nasjonalt og internasjonalt, også i FN og NATO sammenheng.

source: In addition, plagiarism is a violation of the Norwegian Armed Forces’ values, respect, responsibility and courage.
nb: I tillegg er plagiat et brudd på Forsvarets verdigrunnlag, respekt, ansvar og mot.

source: summarise key features in the history of technology and technological development, and describe the engineer’s role in society and the consequences of the development and use of technology, including in military applications.
nb: gjengi hovedtrekk i teknologiens historie og teknologiutvikling, samt beskrive ingeniørens rolle i samfunnet og konsekvenser av utvikling og bruk av teknologi, også innenfor militære anvendelser

source: • explain how information is collected, systematised and utilised in order to answer specific research questions.
nb: • redegjøre for hvordan informasjon samles inn, systematiseres og anvendes for å besvare konkrete forskningsspørsmål.

source: Coordinate transport to and from SHH.
nb: Koordinere transport til og fra SHH.

source: Individual home exam (essay/3000 words maximum).
nb: Individuell skriftlig hjemmeeksamen (essay/maks 3000 ord).

source: Master different linguistic and rhetorical concepts that contribute to the dissemination of arguments in a compelling way.
nb: Fysisk og mental trening og bevissthet for utvikling og ivaretakelse av egen og undergittes fysiske og mentale kapasitet under kriser.

source: The cadets must pass a level 6 physical test prior to the “Winter Exercise” in order to participate in it.
nb: For å delta på «Vinterøvelsen» må kadettene bestå fysisk test nivå 6 før øvelsesstart.

source: operate auxiliary systems in a safe manner in a simulator and in the laboratory.
nb: operere hjelpesystemer på sikker måte i simulator og i laboratoriet.

source: knowledge of vessel traffic services and pilotage
nb: kjennskap til kystadministrasjon og losing

source: obtain, select, evaluate and present information on a relevant methodological basis, and discuss this so that it sheds light on a problem, both in writing and orally, in Norwegian and English
nb: fremskaffe, velge ut, vurdere og presentere informasjon på et relevant metodisk grunnlag, og drøfte dette slik at det belyser en problemstilling, både skriftlig og muntlig, på norsk og engelsk

source: knowledge of proper and safe ship handling
nb: kjennskap til god og sikker behandling av skip

source: Radar theory segment of IMO 1.08 RADAR navigation, plotting and ARPA (Kjerstad, Part 2, Chapters 1-5)
nb: Radarteoridelen av IMO 1.08 RADAR navigasjon, plotting og ARPA (Kjerstad, Del 2, Kapittel 1-5)

source: During the course, the cadets will be assigned administratively and disciplinary to the respective industry schools in the Air Force for the implementation of the basic industry education.
nb: Under emnet vil kadettene avgis administrativt og disiplinært til respektive bransjeskoler i Luftforsvaret for gjennomføringen av den grunnleggende bransjeutdanning.

source: Account for key topics, theories, problems tools and methods in their task area.
nb: Gjøre rede for sentrale temaer, teorier, problemstillinger, verktøy og metoder innenfor sitt oppgaveområde.

source: communicate with Avdeling for geografisk etterretning (AGE) who distribute geographical information to the Armed Forces
nb: kommunisere med Avdeling for geografisk etterretning (AGE) som distribuerer geografisk informasjon til Forsvaret

source: collect, analyse and critically assess various forms of information, employ information to formulate and structure their arguments in an independent manner
nb: innhente, analysere og kritisk vurdere ulike former for informasjon, og bruke informasjon til å strukturere og formulere egne argumenter og resonnementer

source: Important factors such as international law, Norway’s geographical location, Norwegian membership within NATO and the United Nations, as well as being outside of the EU are also reviewed.
nb: Viktige rammefaktorer som folkeretten, Norges geografiske beliggenhet, norsk medlemskap i NATO og FN, samt utenforskap i EU, gjennomgås.

source: • describe the properties of the elements based on their position in the periodic system
nb: • beskrive grunnstoffenes egenskaper ut i fra posisjonen i periodesystemet

source: This is a continuation of the Introduction to English Language and Communication in the Royal Norwegian Air Force which was taught in Air Power Basics (course 5), but this time within the context of an international task force/planning process, and the use of English-language methods and sources.
nb: Dette er en fortsettelse av den introduksjon til engelsk språk og kommunikasjon i Luftforsvaret som ble gitt i Luftmaktens grunnlag (Emne 5), men nå innen kontekst av en internasjonal plangruppe/planprosess, og bruk av engelskspråklig metode og kilder.

source: The concept of tactical radio is prioritised over teaching procedures for the installation and regulation of the settings of army radios.
nb: Konseptet taktisk radio prioriteres i undervisningen fremfor å undervise i prosedyrer for oppsett og innstillinger av Hærens radioer.

source: Lectures, project, report writing and other documentation work and oral presentation
nb: Forelesninger, prosjekt, rapportskriving og øvrig dokumentasjonsarbeid og muntlig fremføring

source: analyse military strategic choices (military strategy), operational concepts and current doctrines within joint military operations.
nb: analysere militærstrategiske valg (militærstrategi), operasjonskonsepter og gjeldende doktriner innenfor militære fellesoperasjoner.

source: Monitor and plan for safe loading, stowage, securing and handling of cargo underway and during unloading.
nb: Overvåke og planlegge sikker lasting, stuing, sikring og ivaretagelse av last underveis og ved lossing.

source: Based on military theoretical perspectives and doctrinal basis given in the course military joint operations 1, military joint operations 2 will largely focus on the skills aspects of the military core competence.
nb: Med utgangspunkt i militærteoretiske perspektiver og doktrinegrunnlag gitt i emnet militære fellesoperasjoner 1, vil militære fellesoperasjoner 2 i stor grad fokusere på de ferdighetsmessige sidene av den militære kjernekompetansen.

source: In the third part of the course (2 weeks), the focus is on what the forces of the various military branches contribute to within a joint operation, and how joint functions support the efforts to integrate, synchronise and lead military operations.
nb: I emnets tredje del (2 uker) settes fokuset på hva de ulike militære forsvarsgrensvise styrkene bidrar med i en fellesoperasjon, og hvordan fellesfunksjoner understøtter arbeidet med å integrere, synkronisere og styre militære operasjoner.

source: Academic, character, and fitness eligibility as validated through the military selection process.
nb: Militær tjenestedyktighet og fullført opptak og seleksjon.

source: know how demanding conditions affect military education, training, tactics and operations.
nb: kjenne til hvordan krevende forhold påvirker militær utdanning, trening, taktikk og operasjoner.

source: Account for organisational theories that are relevant to understanding the RNAF’s composition and structure.
nb: gjøre rede for organisasjonsteorier som er relevant for å forstå Luftforsvaret oppbygning og struktur.

source: Laboratory exercise with measurement of exhaust gases.
nb: Laboratorieøvelse med måling av avgasser.

source: the ability to exchange views and experiences with others within the area of meteorology and oceanography and through this contribute to the development of good practice
nb: kan offiseren utveksle synspunkter og erfaringer med andre med bakgrunn innenfor meteorologi og oseanografi og gjennom dette bidra til utvikling av god praksis

source: Digital technology: Repetition of numerical systems and binary arithmetic, Boolean algebra with simplification of logical functions, Karnaugh chart, ports and construction of combinatorial circuits.
nb: Repetisjon av tallsystemer og binær aritmetikk, boolsk algebra med forenkling av logiske funksjoner, Karnaugh-diagram, porter og konstruksjon av kombinatoriske kretser.

source: Tasks and compulsory exercises include problem solving, discussions, collaboration and individual work.
nb: Oppgaver og obligatoriske øvinger omfatter problemløsing, diskusjoner, samarbeid og individuelt arbeid.

source: • apply a relevant concept and system of formulae
nb: • anvende et relevant begreps- og formelapparat

source: The project report is included as part of the assessment in the course LED3201 The Officer.
nb: Prosjektrapporten inngår som en del av mappevurderingen i emnet LED3201 Offiseren.

source: The course follows the lecture (F) and practical experience (Ø) classes on the schedule during teaching weeks on the academic calender for SKSK (UV weeks).
nb: Emnet følger F og Ø timene i timeplanen i de ukene årsprogrammet for SKSK har undervisningsuke(UV uke).

source: This involves assuming leadership positions and key positions in one of the army battalions during a Field Training Exercise and on the Tactical Co-operation Course organised by the Army Weapons School (AWS).
nb: Dette ved å overta lederstillinger og nøkkelposisjoner i en av Hærens kampbataljoner under en føringsøvelse og kurs i taktisk samvirke i regi av Hærens Våpenskole (HVS).

source: Programming in C ++: Troubleshooting, algorithms and programme maps.
nb: Programmering i C++:Problemløsing, algoritmer og programkart.

source: • explain about how the threat picture, societal and technological development, creates opportunities, challenges and needs in the Armed Forces
nb: • forklare om hvordan trusselbilde, samfunns- og teknologisk utvikling, skaper muligheter, utfordringer og behov i Forsvaret

source: Global and local emission regulations, laboratory exercise on trial engine.
nb: Globale og lokale utslippsbestemmelser, laboratorieøvelse på forsøksmotor.

source: apply subject-relevant software, has broad engineering digital expertise and basic, relevant programming skills.
nb: anvende fagrelevant programvare, har bred ingeniørfaglig digital kompetanse og grunnleggende, relevante programmeringsferdigheter.

source: US Government (further information will come).
nb: US Government (tekst og henvisning kommer senere).

source: In this section, legal conditions and challenges related to civil-military cooperation during the planning and implementation of joint operations will also be explored.
nb: I denne delen vil også juridiske forhold og utfordringer knyttet til sivilmilitært samarbeid under planlegging og gjennomføring av fellesoperasjoner bli behandlet.

source: • Measuring instruments for antenna and transmission lines
nb: • Måleinstrumenter for antenne og transmisjonslinjer

source: • find the transitions between time and frequency representation of a signal
nb: • finne overgangene mellom tids- og frekvens representasjon av et signal

source: This requires a basic knowledge and understanding of the organisation/people with whom you plan together and are a part of, how leadership is exercised and how the communications and production of the task force operate within in a larger process (command and control), the use of language, culture and international cooperation to have an impact on operational task forces with international participation (allied support (article 5)/international operations), and basic operational management to make plans that manage the resources of the Norwegian Armed Fores in a sufficient and beneficial manner.
nb: Dette krever grunnleggende kunnskap og forståelse for den organisasjon / mennesker man er en del av og planlegger sammen med, hvordan ledelse utøves og hvordan plangruppens kommunikasjon og produkter inngår i en større prosess (kommando og kontroll), språk, kultur og internasjonalt samarbeid for å få gjennomslag i operative plangrupper med internasjonal deltakelse (alliert hjelp (artikkel 5) / internasjonale operasjoner), og grunnleggende virksomhetsstyring for å legge planer som forvalter Forsvarets ressurser på en tilstrekkelig god måte.

source: Lifting techniques/equipment/procedures and regulations.
nb: Løfteteknikk/utstyr /prosedyrer og regelverk.

source: The method cadets have learned in the simulator will be the training goal for a practical experience voyage aboard Kvarven and Nordnes under supervision.
nb: Den metoden kadettene har lært i simulatoren blir øvingsmålet i en praktisk seilas om bord på Kvarven og Nordnes med veiledning.

source: Week 3: Efficiency, opportunities and limitations
nb: Uke 3: Effektivitet, muligheter og begrensninger

source: describe safe management and operation of marine main engines on simulator and in the laboratory.
nb: beskrive sikker operering og drift av marint hovedmaskineri på simulator og i laboratoriet.

source: UVB squadron assists cadet group UVB, etc.
nb: UVB skvadron bistår kadettgruppe UVB etc.

source: Lectures, exercises, laboratory work and excursion.
nb: Forelesninger, øvinger, laboratoriearbeid og ekskursjon.

source: use stochastic and statistical methods and tools relevant to his/her field of study
nb: bruke stokastiske og statistiske metoder og verktøy relevant for sitt fagfelt

source: The course provides you as a cadet with the opportunity for your own development through practice, teaching, teamwork, and self-studies.
nb: Emnet gir kadettene mulighet for egenutvikling gjennom praksis, undervisning, gruppearbeid, og egenstudier.

source: describe basic concepts and relationships in ballistics.
nb: beskrive grunnleggende begreper og sammenhenger innen ballistikk.

source: In this, the cadets will be introduced to current military theoretical perspectives, operational concepts and doctrines as a basis for understanding the possibilities and limitations of military forces within a joint operational framework.
nb: I dette vil kadettene bli introdusert til aktuelle militærteoretiske perspektiver, operasjonskonsepter og doktriner som grunnlag for å forstå militære styrkers muligheter og begrensninger i en fellesoperativ ramme.

source: – ethical issues and dilemmas, as well as civilian military cooperation.
nb: – etiske spørsmål og dilemmaer og sivilmilitært samarbeid.

source: Explain the purpose behind architectural work, service orientation and NATO's C3 taxonomy
nb: Forklare hensikten bak arkitekturarbeid, tjenesteorientering og NATOs C3-taksonomi

source: A problem-based analysis of NATO's Operational Planning Doctrine (AJP-5) is central.
nb: En problembasert analyse av NATOs doktrine for operasjonsplanlegging (AJP-5) er sentral.

source: Theme 3 deals with the execution of operational logistics.
nb: Tema 3 tar for seg operativ logistikk i praksis.

source: Subtopic 2 – Military problem-solving at the operational level: The second subtopic of the course (one week) focuses on military problem-solving at the operational level, and how this level interacts with the superior and subordinate levels of the planning process (
nb: Del 2 – Militær problemløsning på operasjonelt nivå: Emnets andre del (en uke) retter fokus mot militær problemløsning på operasjonelt nivå, og hvordan dette nivået interagerer og samarbeider med overordnet og underordnet nivå under planprosessen (

source: The course covers the following academic content: interference and diffraction, light refraction and reflection, lenses and image formation, photons, emission and absorption of light, thermal radiation, black and grey bodies, quantum states in atoms, laser, simple energy band theory (semi-conductor physics), electro-optical sensors, electromagnetic waves in waveguides, mode and critical frequency, microwave components, radar.
nb: interferens og diffraksjon, lysbrytning og refleksjon, linser og avbildning, fotoner, emisjon og absorpsjon av lys, termisk stråling, svarte og grå gjenstander, kvantetilstander i atomer, laseren, enkel energibåndteori (halvlederfysikk), elektrooptiske sensorer, elektromagnetiske bølger i bølgeledere, modus og kritisk frekvens, mikrobølgekomponenter, radar.

source: Theme 2 focuses on how changes in the operating environment have affected the UN's approach to
nb: Tema 2 fokuserer på hvordan endringer i operasjonsmiljøet har påvirket FNs tilnærming til

source: Assembly and machine code.
nb: Assembly og maskinkode.

source: know your own and collective resilience and faith
nb: kjenne til egen og kollektiv robusthet og mestringstro

source: knowledge of international agreements such as the INCSEA agreement and AMVER
nb: kjennskap til internasjonale avtaler som INCSEA – avtalen og AMVER

source: Maintenance principles, concepts, terminology, status tests and inspection methods.
nb: Vedlikeholdsprinsipper, begreper, terminologi, tilstandskontroll- og inspeksjonsmetoder.

source: The curriculum is to be introduced during the academic year 2018-2019.
nb: Pensum legges inn i løpet av studieåret 2018-2019.

source: Handbooks and project guides from turbine- and pump suppliers.
nb: Håndbøker og prosjektveiledninger fra turbin- og pumpeleverandører.

source: The course follows STCW code table A-III/2 and the STCW function marine engineering at the management level.
nb: Emnet følger STCW-kode A-III/2 og STCW-funksjon Maskineri på ledelsesnivå.

source: Describe the strategic, operational and tactical levels of leadership in Norway, as well as the strategic and operational management level of NATO
nb: beskrive det strategiske, operasjonelle og taktiske ledelsesnivået i Norge, samt det strategiske og operasjonelle ledelsesnivået i NATO

source: Cooling water systems, additives and analysis of cooling water samples.
nb: Kjølevannssystemer, tilsetninger og analyse av kjølevannsprøver.

source: What experiences do Norwegian officers have in connection with the exercise of leadership in international operations (Afghanistan, Libya, Mali, Bosnia/Kosovo, the Balkans)?
nb: Hvilke erfaringer har norske offiserer knyttet til utøvelse av lederskap i internasjonale operasjoner (Afghanistan, Libya, Mali, Bosnia/Kosovo, Balkan)?

source: For the industry Control & Warning, the course is conducted at the Air Force's Control and Warning School (LKVS) in Sørreisa.
nb: For bransjen Kontroll & Varsling gjennomføres emnet ved Luftforsvarets kontroll og varslingsskole (LKVS) i Sørreisa.

source: The candidate has knowledge of electromagnetism and signal processing and has broad knowledge of electrical components, circuits and systems.
nb: Kandidaten har kunnskap om elektromagnetisme og signalbehandling, og har bred kunnskap om elektriske komponenter, kretser og systemer.

source: The evaluation will most likely be organized in the form of a "focus group"
nb: Evalueringen vil mest sannsynligvis blir organisert i form av en "focus gruppe"

source: analyse operational data and operational problems related to the engines and associate this with operating and maintenance tasks.
nb: analysere driftsdata og driftsproblemer knyttet til maskineriet og knytte dette mot drifts- og vedlikeholdsoppgaver.

source: The subject provides cadets with insight into, and experience of, the very demanding physical and mental pressure conflict can incur, and how this can affect soldiers in the resolution of a mission.
nb: De skal kjenne til hva fysiske og psykiske stridsreaksjoner innebærer, hvordan lederskap påvirker motstandsdyktighet og evne til oppdragsløsning, samt betydningen av troverdighet, robusthet og samhold.

source: think and reason mathematically, that is, set up mathematical models, solve mathematical problems, both analytically and numerically, and evaluate and account for his/her results
nb: tenke og resonnere matematisk, det vil si, stille opp matematiske modeller, løse matematiske problemer, både analytisk og numerisk, og vurdere og gjøre rede for sine resultater

source: • recognize a conservative field and calculate a potential function for the field
nb: • gjenkjenne et konservativt felt og beregne en potensialfunksjon for feltet

source: The mutual influence between society and military power from 1750 to today.
nb: Den gjensidige påvirkning mellom samfunnet og militærmakten fra 1750 til i dag.

source: The course deals with the most important functions in mathematics, their properties and applications.
nb: Emnet handler om de viktigste funksjoner i matematikken, deres egenskaper og anvendelser.

source: describe MilGeo's role in Intelligence Preparation of the Operational Environment (IPOE), focusing on steps 1 and 2
nb: beskrive MilGeo sin rolle i Intelligence Preparation of the Operational Environment (IPOE), med fokus på trinn 1 og 2

source: knowledge of magnetism and degaussing, as well as degaussing facilities on military vessels.
nb: kunnskap om magnetisme og degaussing, samt degaussingsanlegg på militære fartøy.

source: • perform calculations on baseband
nb: • utføre beregninger på basisbånd

source: This is taken to mean the local political, military, economic, social, legal and cultural conditions in an operational area.
nb: Dette forstås som lokale politiske, militære, økonomiske, sosiale, juridiske og kulturelle forhold i et operasjonsområde.

source: The radar course topic is taken from the IMO module course 1.08 Radar, ARPA, CRM and the SAR course.
nb: Delemnet radar er hentet fra IMO modullkurs1.08 Radar, ARPA, CRM og SAR kurset.

source: The course’s final topic (2 weeks) focuses on national crisis management within the conflict spectrum from peace via crisis to war, including Norway's relationship with allies.
nb: Emnets avsluttende tema (2 uker) setter fokus på nasjonal krisehåndtering i konfliktspekteret fra fred, via krise til krig, og herunder Norges forhold til allierte.

source: plan and conduct instructions and oral presentations.
nb: planlegge og gjennomføre undervisning og muntlige presentasjoner.

source: describe control and regulation of auxiliary engines.
nb: beskrive kontroll og regulering av hjelpemaskineri.

source: Practical laboratory work, use of measuring instruments and troubleshooting.
nb: Praktisk laboratoriearbeid, bruk av måleinstrumenter og feilsøking.

source: apply theoretical and practical skills for maintaining and increasing his/her own and the department’s operational performance.
nb: Anvende teoretiske og praktiske ferdigheter for vedlikehold og økning av egen og avdelingens operative yteevne.

source: This will contribute to discoveries of how such conditions impact soldiers, as well as the role of the officer and commander in such situations, to ensure that the missions are resolved.
nb: Kurset skal tilføre kadettene teoretisk og praktisk kompetanse for å sette dem i stand til å fungere som troppssjef og yngre offiser i ingeniørvåpenet og Forsvaret.

source: The level of ambition is high, where tasks such as protecting civilians, reforming security sectors, and state and peacebuilding dominate.
nb: Ambisjonsnivået er høyt, der oppgaver som beskyttelse av sivile, reform av sikkerhetssektorer, og stats- og fredsbygging dominerer.
